/*****************************************************************************\
* Copyright (c), Future Entertainment World / Seoul, Republic of Korea        *
* All Rights Reserved.                                                        *
*                                                                             *
* This document contains proprietary and confidential information.  No        *
* parts of this document or the computer program it embodies may be in        *
* any way copied, duplicated, reproduced, translated into a different         *
* programming language, or distributed to any person, company, or             *
* corporation without the prior written consent of Future Entertainment World *
\*****************************************************************************/


#include "stdafx.h"
#include <windows.h>
#include <windowsx.h>
#include <ddraw.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <Io.h>
#include <Math.h>


#include "Dragon.h"
#include "Char.h"
#include "GameProc.h"
#include "Map.h"
#include "Hangul.h"
#include "Tool.h"

#include "DirectSound.h"

#define __HONG_SPRITE_H__
#include "Hong_Sprite.h"
#include "Hong_Light.h"
#include "Hong_Sub.h"

#include "Convert565to555.h"
#include "MouseCursor.h"
#include "Effect.h"


extern CHARACTERLIST		g_CharacterList;

WORD	AddTableR[128];
WORD	AddTableG[256];
WORD	AddTableB[128];

WORD	SubTableR[64];
//WORD	SubTableg[64];
WORD	SubTableG[128];
WORD	SubTableB[64];


{			
	FILE *fp;
	
	fp = Fopen( "./char/00ClothOrderBasic.bin","rb" );
	if( fp )
	{		
		for( int i = 0 ; i < 8 ; i ++)
			for( int j = 0 ; j < 75 ; j ++)
				fread( &SpriteOrder[0][i][j], 1,1, fp );
			fclose(fp);
	}		
	fp = Fopen( "./char/01ClothOrderBasic.bin","rb" );
	if( fp )
	{		
		for( int i = 0 ; i < 8 ; i ++)
			for( int j = 0 ; j < 75 ; j ++)
				fread( &SpriteOrder[1][i][j], 1,1, fp );
			fclose(fp);
	}		
	fp = Fopen( "./char/00ClothOrderBow.bin","rb" );
	if( fp )
	{		
		for( int i = 0 ; i < 8 ; i ++)
			for( int j = 0 ; j < 75 ; j ++)
				fread( &SpriteOrder[2][i][j], 1,1, fp );
			fclose(fp);
	}		
	fp = Fopen( "./char/01ClothOrderBow.bin","rb" );
	if( fp )
	{		
		for( int i = 0 ; i < 8 ; i ++)
			for( int j = 0 ; j < 75 ; j ++)
				fread( &SpriteOrder[3][i][j], 1,1, fp );
			fclose(fp);
	}		
}			






//----------------------------------------

// 배경 Sprite를 찍기 위한 루틴.


void PutTileNotCliping( int x, int y, LPVOID Stmp, LPVOID dest )
{		
	LPVOID	Dtmp = (LPVOID)( (char*)dest + y * dDxSize + (x * 2 )); //removes 64bytes
	
	_asm{
		push	es;
		
		push	ds;
		pop		es;
		
		mov     ecx, dDxSize;
		sub     ecx, 64;
		
		mov		edi,Dtmp;
		mov		esi,Stmp;
		
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // subjtracting 64byte from edi =0
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 1
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 2
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 3
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 4
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 5
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 6
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 7
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 8
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 9
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 10
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 11
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 12
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 13
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 14
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 15
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 16
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 17
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 18
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 19
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 20
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 21
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 22
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 23
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 24
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 25
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 26
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 27
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 28
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 29
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		add edi, ecx; // 30
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		movsd;
		
		pop		es;
	}
}


void PutTileCliping( int x, int y, LPVOID Stmp, LPVOID dest, int lx, int rx, int ty, int by )
{
	int  xl = TILE_SIZE;
	int  yl = TILE_SIZE;
	WORD *p, *sou;
	int  i,j;
	
	sou = (WORD *)((char*)Stmp + (lx + ty * xl) * 2);
	for( i = ty ; i < by ; i ++)
	{	
		p = (WORD*)((char *)dest + x * 2 + y * dDxSize);
		for( j = lx ; j < rx ; j ++, p++, sou++ )
			*p = *sou;
		
		sou += ( xl - ( rx - lx ) );
		y ++;
	}	
}


void PutTile( int x, int y, LPVOID Stmp, LPVOID dest )
{
	int	lx, rx, ty, by , IsC=0;
	int xl = TILE_SIZE;
	int yl = TILE_SIZE;
	
	if( x >= SCREEN_WIDTH  )			return; 
	else if( x + xl < 0 )	return; 
	if( y >= SCREEN_HEIGHT )			return; 
	else if( y + yl < 0  )	return;
	
	rx = xl;
	lx = 0;
	ty = 0;
	by = yl;
	
	if( x + xl > SCREEN_WIDTH )
	{
		rx -= x + xl - SCREEN_WIDTH;
		IsC = 1;
	}
	if( x < 0 )
